espressif/esp-idf/components/soc/esp32c6/register/soc/interrupt_matrix_reg.h
/**
 * SPDX-FileCopyrightText: 2022-2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** INTMTX_CORE0_WIFI_MAC_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_WIFI_MAC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x0)
/** INTMTX_CORE0_WIFI_MAC_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_WIFI_MAC_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_WIFI_MAC_INTR_MAP_M  (INTMTX_CORE0_WIFI_MAC_INTR_MAP_V << INTMTX_CORE0_WIFI_MAC_INTR_MAP_S)
#define INTMTX_CORE0_WIFI_MAC_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_WIFI_MAC_INTR_MAP_S  0

/** INTMTX_CORE0_WIFI_MAC_NMI_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_WIFI_MAC_NMI_MAP_REG (DR_REG_INTMTX_BASE + 0x4)
/** INTMTX_CORE0_WIFI_MAC_NMI_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_WIFI_MAC_NMI_MAP    0x0000001FU
#define INTMTX_CORE0_WIFI_MAC_NMI_MAP_M  (INTMTX_CORE0_WIFI_MAC_NMI_MAP_V << INTMTX_CORE0_WIFI_MAC_NMI_MAP_S)
#define INTMTX_CORE0_WIFI_MAC_NMI_MAP_V  0x0000001FU
#define INTMTX_CORE0_WIFI_MAC_NMI_MAP_S  0

/** INTMTX_CORE0_WIFI_PWR_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_WIFI_PWR_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x8)
/** INTMTX_CORE0_WIFI_PWR_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_WIFI_PWR_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_WIFI_PWR_INTR_MAP_M  (INTMTX_CORE0_WIFI_PWR_INTR_MAP_V << INTMTX_CORE0_WIFI_PWR_INTR_MAP_S)
#define INTMTX_CORE0_WIFI_PWR_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_WIFI_PWR_INTR_MAP_S  0

/** INTMTX_CORE0_WIFI_BB_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_WIFI_BB_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xc)
/** INTMTX_CORE0_WIFI_BB_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_WIFI_BB_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_WIFI_BB_INTR_MAP_M  (INTMTX_CORE0_WIFI_BB_INTR_MAP_V << INTMTX_CORE0_WIFI_BB_INTR_MAP_S)
#define INTMTX_CORE0_WIFI_BB_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_WIFI_BB_INTR_MAP_S  0

/** INTMTX_CORE0_BT_MAC_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_BT_MAC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x10)
/** INTMTX_CORE0_BT_MAC_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_BT_MAC_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_BT_MAC_INTR_MAP_M  (INTMTX_CORE0_BT_MAC_INTR_MAP_V << INTMTX_CORE0_BT_MAC_INTR_MAP_S)
#define INTMTX_CORE0_BT_MAC_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_BT_MAC_INTR_MAP_S  0

/** INTMTX_CORE0_BT_BB_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_BT_BB_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x14)
/** INTMTX_CORE0_BT_BB_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_BT_BB_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_BT_BB_INTR_MAP_M  (INTMTX_CORE0_BT_BB_INTR_MAP_V << INTMTX_CORE0_BT_BB_INTR_MAP_S)
#define INTMTX_CORE0_BT_BB_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_BT_BB_INTR_MAP_S  0

/** INTMTX_CORE0_BT_BB_NMI_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_BT_BB_NMI_MAP_REG (DR_REG_INTMTX_BASE + 0x18)
/** INTMTX_CORE0_BT_BB_NMI_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_BT_BB_NMI_MAP    0x0000001FU
#define INTMTX_CORE0_BT_BB_NMI_MAP_M  (INTMTX_CORE0_BT_BB_NMI_MAP_V << INTMTX_CORE0_BT_BB_NMI_MAP_S)
#define INTMTX_CORE0_BT_BB_NMI_MAP_V  0x0000001FU
#define INTMTX_CORE0_BT_BB_NMI_MAP_S  0

/** INTMTX_CORE0_LP_TIMER_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_LP_TIMER_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x1c)
/** INTMTX_CORE0_LP_TIMER_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_LP_TIMER_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_LP_TIMER_INTR_MAP_M  (INTMTX_CORE0_LP_TIMER_INTR_MAP_V << INTMTX_CORE0_LP_TIMER_INTR_MAP_S)
#define INTMTX_CORE0_LP_TIMER_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_LP_TIMER_INTR_MAP_S  0

/** INTMTX_CORE0_COEX_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_COEX_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x20)
/** INTMTX_CORE0_COEX_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_COEX_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_COEX_INTR_MAP_M  (INTMTX_CORE0_COEX_INTR_MAP_V << INTMTX_CORE0_COEX_INTR_MAP_S)
#define INTMTX_CORE0_COEX_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_COEX_INTR_MAP_S  0

/** INTMTX_CORE0_BLE_TIMER_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_BLE_TIMER_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x24)
/** INTMTX_CORE0_BLE_TIMER_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_BLE_TIMER_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_BLE_TIMER_INTR_MAP_M  (INTMTX_CORE0_BLE_TIMER_INTR_MAP_V << INTMTX_CORE0_BLE_TIMER_INTR_MAP_S)
#define INTMTX_CORE0_BLE_TIMER_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_BLE_TIMER_INTR_MAP_S  0

/** INTMTX_CORE0_BLE_SEC_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_BLE_SEC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x28)
/** INTMTX_CORE0_BLE_SEC_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_BLE_SEC_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_BLE_SEC_INTR_MAP_M  (INTMTX_CORE0_BLE_SEC_INTR_MAP_V << INTMTX_CORE0_BLE_SEC_INTR_MAP_S)
#define INTMTX_CORE0_BLE_SEC_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_BLE_SEC_INTR_MAP_S  0

/** INTMTX_CORE0_I2C_MST_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_I2C_MST_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x2c)
/** INTMTX_CORE0_I2C_MST_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_I2C_MST_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_I2C_MST_INTR_MAP_M  (INTMTX_CORE0_I2C_MST_INTR_MAP_V << INTMTX_CORE0_I2C_MST_INTR_MAP_S)
#define INTMTX_CORE0_I2C_MST_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_I2C_MST_INTR_MAP_S  0

/** INTMTX_CORE0_ZB_MAC_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_ZB_MAC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x30)
/** INTMTX_CORE0_ZB_MAC_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_ZB_MAC_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_ZB_MAC_INTR_MAP_M  (INTMTX_CORE0_ZB_MAC_INTR_MAP_V << INTMTX_CORE0_ZB_MAC_INTR_MAP_S)
#define INTMTX_CORE0_ZB_MAC_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_ZB_MAC_INTR_MAP_S  0

/** INTMTX_CORE0_PMU_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_PMU_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x34)
/** INTMTX_CORE0_PMU_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_PMU_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_PMU_INTR_MAP_M  (INTMTX_CORE0_PMU_INTR_MAP_V << INTMTX_CORE0_PMU_INTR_MAP_S)
#define INTMTX_CORE0_PMU_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_PMU_INTR_MAP_S  0

/** INTMTX_CORE0_EFUSE_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_EFUSE_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x38)
/** INTMTX_CORE0_EFUSE_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_EFUSE_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_EFUSE_INTR_MAP_M  (INTMTX_CORE0_EFUSE_INTR_MAP_V << INTMTX_CORE0_EFUSE_INTR_MAP_S)
#define INTMTX_CORE0_EFUSE_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_EFUSE_INTR_MAP_S  0

