espressif/esp-idf/components/soc/esp32c6/register/soc/interrupt_matrix_reg.h
/** INTMTX_CORE0_TG0_T0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_TG0_T0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xcc)
/** INTMTX_CORE0_TG0_T0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_TG0_T0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_TG0_T0_INTR_MAP_M  (INTMTX_CORE0_TG0_T0_INTR_MAP_V << INTMTX_CORE0_TG0_T0_INTR_MAP_S)
#define INTMTX_CORE0_TG0_T0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_TG0_T0_INTR_MAP_S  0

/** INTMTX_CORE0_TG0_T1_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_TG0_T1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xd0)
/** INTMTX_CORE0_TG0_T1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_TG0_T1_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_TG0_T1_INTR_MAP_M  (INTMTX_CORE0_TG0_T1_INTR_MAP_V << INTMTX_CORE0_TG0_T1_INTR_MAP_S)
#define INTMTX_CORE0_TG0_T1_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_TG0_T1_INTR_MAP_S  0

/** INTMTX_CORE0_TG0_WDT_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_TG0_WDT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xd4)
/** INTMTX_CORE0_TG0_WDT_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_TG0_WDT_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_TG0_WDT_INTR_MAP_M  (INTMTX_CORE0_TG0_WDT_INTR_MAP_V << INTMTX_CORE0_TG0_WDT_INTR_MAP_S)
#define INTMTX_CORE0_TG0_WDT_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_TG0_WDT_INTR_MAP_S  0

/** INTMTX_CORE0_TG1_T0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_TG1_T0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xd8)
/** INTMTX_CORE0_TG1_T0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_TG1_T0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_TG1_T0_INTR_MAP_M  (INTMTX_CORE0_TG1_T0_INTR_MAP_V << INTMTX_CORE0_TG1_T0_INTR_MAP_S)
#define INTMTX_CORE0_TG1_T0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_TG1_T0_INTR_MAP_S  0

/** INTMTX_CORE0_TG1_T1_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_TG1_T1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xdc)
/** INTMTX_CORE0_TG1_T1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_TG1_T1_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_TG1_T1_INTR_MAP_M  (INTMTX_CORE0_TG1_T1_INTR_MAP_V << INTMTX_CORE0_TG1_T1_INTR_MAP_S)
#define INTMTX_CORE0_TG1_T1_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_TG1_T1_INTR_MAP_S  0

/** INTMTX_CORE0_TG1_WDT_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_TG1_WDT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xe0)
/** INTMTX_CORE0_TG1_WDT_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_TG1_WDT_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_TG1_WDT_INTR_MAP_M  (INTMTX_CORE0_TG1_WDT_INTR_MAP_V << INTMTX_CORE0_TG1_WDT_INTR_MAP_S)
#define INTMTX_CORE0_TG1_WDT_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_TG1_WDT_INTR_MAP_S  0

/** INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xe4)
/** INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_M  (INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_V << INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_S)
#define INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_S  0

/** INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xe8)
/** INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_M  (INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_V << INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_S)
#define INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_S  0

/** INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xec)
/** INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_M  (INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_V << INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_S)
#define INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_S  0

/** INTMTX_CORE0_APB_ADC_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_APB_ADC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xf0)
/** INTMTX_CORE0_APB_ADC_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_APB_ADC_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_APB_ADC_INTR_MAP_M  (INTMTX_CORE0_APB_ADC_INTR_MAP_V << INTMTX_CORE0_APB_ADC_INTR_MAP_S)
#define INTMTX_CORE0_APB_ADC_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_APB_ADC_INTR_MAP_S  0

/** INTMTX_CORE0_PWM_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_PWM_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xf4)
/** INTMTX_CORE0_PWM_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_PWM_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_PWM_INTR_MAP_M  (INTMTX_CORE0_PWM_INTR_MAP_V << INTMTX_CORE0_PWM_INTR_MAP_S)
#define INTMTX_CORE0_PWM_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_PWM_INTR_MAP_S  0

/** INTMTX_CORE0_PCNT_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_PCNT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xf8)
/** INTMTX_CORE0_PCNT_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_PCNT_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_PCNT_INTR_MAP_M  (INTMTX_CORE0_PCNT_INTR_MAP_V << INTMTX_CORE0_PCNT_INTR_MAP_S)
#define INTMTX_CORE0_PCNT_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_PCNT_INTR_MAP_S  0

/** INTMTX_CORE0_PARL_IO_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_PARL_IO_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xfc)
/** INTMTX_CORE0_PARL_IO_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_PARL_IO_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_PARL_IO_INTR_MAP_M  (INTMTX_CORE0_PARL_IO_INTR_MAP_V << INTMTX_CORE0_PARL_IO_INTR_MAP_S)
#define INTMTX_CORE0_PARL_IO_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_PARL_IO_INTR_MAP_S  0

/** INTMTX_CORE0_SLC0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_SLC0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x100)
/** INTMTX_CORE0_SLC0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_SLC0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_SLC0_INTR_MAP_M  (INTMTX_CORE0_SLC0_INTR_MAP_V << INTMTX_CORE0_SLC0_INTR_MAP_S)
#define INTMTX_CORE0_SLC0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_SLC0_INTR_MAP_S  0

/** INTMTX_CORE0_SLC1_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_SLC1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x104)
/** INTMTX_CORE0_SLC1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTMTX_CORE0_SLC1_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_SLC1_INTR_MAP_M  (INTMTX_CORE0_SLC1_INTR_MAP_V << INTMTX_CORE0_SLC1_INTR_MAP_S)
#define INTMTX_CORE0_SLC1_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_SLC1_INTR_MAP_S  0

